/*
//функцію для перевірки спаму в переданому рядку. Функція повертає true, якщо рядок містить спам. Спамом вважати наступні слова: 100% безкоштовно, збільшення продажів, тільки сьогодні, не видаляйте, ххх. Функція має бути нечутливою до регістру.
// let str = String('ххх');
// function spam(str){
  
//   let active = false;
//   let spamArray=['100% безкоштовно', 'збільшення продажів', 'тільки сьогодні', 'не видаляйте', 'ххх'];
// for(let i=0; i<spamArray.length; i++){
//   if(str.tolowerCase().includes(spamArray[i])){
//     active=true;
//     break;
//   }
// }
// return active;
// }
// console.log(`${spam(str)}`);
*/